package ru.geekbrains.java3.l6;

/**
 * Написать метод, которому в качестве аргумента передается не пустой одномерный
 * целочисленный массив, метод должен вернуть новый массив, который получен путем
 * вытаскивания элементов из исходного массива, идущих после последней четверки. Входной
 * массив должен содержать хотя бы одну четверку, в противном случае в методе необходимо
 * выбросить RuntimeException.
 * Написать набор тестов для этого метода (варианта 3-4 входных данных)
 * вх: [ 1 2 4 4 2 3 4 1 7 ] -> вых: [ 1 7 ]
 *  Написать метод, который проверяет что массив состоит только из чисел 1 и 4. Если в массиве
 * нет хоть одной 4 или 1, то метод вернет false;
 * Написать набор тестов для этого метода (варианта 3-4 входных данных)
 */
public class MainApp {
}
